{"pageProps":{"project":{"slug":"Future_Bridge","project_name":"Future Bridge Design system","role":"UX Analyst","teamSize":25,"projectType":"In-house","contribution":"Reduced user error by 50% | Increased developer engagement by 70%  | Delivered projects within budget and on schedule","detail":"Cheers Interactive Design System was instrumental in refining our marketing research and consultancy offerings through user-centered design.  This yielded innovative, user-friendly platforms, significantly boosting client satisfaction and operational efficiency by simplifying complex data analysis and reporting.","photo":["/project/DesignSytem/Fb-1.png","/project/DesignSytem/Fb-2.png","/project/DesignSytem/Fb-3.png","/project/DesignSytem/Fb-4.png","/project/DesignSytem/Fb-5.png","/project/DesignSytem/Fb-6.png","/project/DesignSytem/Fb-7.png","/project/DesignSytem/Fb-8.png"],"year":"2023-2023","Learning":"Teamwork, Design, Team Lead, work Performance, Task Management","technology":["UX tools ","Interview ","Survey ","Adobe XD","Mero","Power Point","Excel","Agile"],"steps":["Color Palette: Defined a modern, accessible color palette aligning with Future Bridge’s brand identity. Included primary, secondary, neutral, and semantic tones (info, success, warning, error) while ensuring WCAG AA compliance for all UI elements.","Typography: Established a scalable typographic framework with responsive font sizes and consistent typographic hierarchy. Focused on improving readability and maintaining brand coherence across web and mobile platforms.","Buttons: Designed modular button components with uniform padding, interaction states (hover, active, focus, disabled), and semantic color variants. Ensured consistency in spacing, icon usage, and affordance throughout the system.","Input Fields (Forms): Created standardized input components including text inputs, textareas, select dropdowns, checkboxes, and switches. Emphasized accessibility, clear validation states, and seamless keyboard navigation.","Cards: Developed card components for dashboards, content previews, and list items with adaptable layouts and elevation levels. Prioritized visual hierarchy, responsiveness, and edge-case flexibility.","Modals: Contributed to modal and drawer patterns supporting focused tasks and notifications. Integrated focus trapping, keyboard accessibility, and smooth animations to enhance user experience.","Navigation: Built adaptive navigation systems including global headers, sidebars, and tab navigations. Focused on scalable architecture, breadcrumb support, and mobile responsiveness.","Icons: Helped build and manage a unified icon set using SVG for flexibility and performance. Ensured consistent stroke weight, padding, and alignment with text and UI components.","Alerts & Notifications: Designed alert and toast notification components with contextual icons, color indicators, and responsive dismissal behaviors. Supported non-intrusive feedback for both real-time and form-based actions.","Grid System & Layouts: Developed a responsive 12-column grid system and utility-based layout patterns. Enabled seamless alignment and spacing across page templates, aiding in design consistency and development efficiency.","Layout Templates: Created adaptable layout templates for use cases like landing pages, dashboards, profile settings, and onboarding flows. Supported layout tokens for easy configuration and variant management.","Data Tables: Implemented data table components with features like sorting, filtering, row selection, and pagination. Focused on readability, empty states, loading skeletons, and mobile adaptability."],"category":"DesignSystem","fileStructure":""}},"__N_SSG":true}