{"pageProps":{"project":{"slug":"Cheers_interctive","project_name":"Cheers interctive Design system","role":"UX Analyst","teamSize":25,"projectType":"In-house","contribution":"Reduced user error by 20% | Increased developer engagement by 30%  | Delivered projects within budget and on schedule","detail":"Cheers Interactive Design System was instrumental in refining our marketing research and consultancy offerings through user-centered design.  This yielded innovative, user-friendly platforms, significantly boosting client satisfaction and operational efficiency by simplifying complex data analysis and reporting.","photo":["/project/DesignSytem/Ch-1.png","/project/DesignSytem/Ch-2.png","/project/DesignSytem/Ch-3.png","/project/DesignSytem/Ch-4.png","/project/DesignSytem/Ch-5.png","/project/DesignSytem/Ch-6.png","/project/DesignSytem/Ch-7.png","/project/DesignSytem/Ch-8.png","/project/DesignSytem/Ch-9.png"],"year":"2023-2023","Learning":"Teamwork, Design, Team Lead, work Performance, Task Management","technology":["UX tools ","Interview ","Survey ","Adobe XD","Mero","Power Point","Excel","Agile"],"steps":["Color Palette: Contributed to building an accessible and brand-aligned color system covering primary, secondary, accent, and semantic (success, warning, error) colors. Prioritized WCAG AA contrast ratios to ensure inclusivity and readability across all components.","Typography: Helped define a consistent typographic system with clear hierarchy—establishing heading styles, body text, and caption standards. Focused on legibility, responsive behavior, and brand alignment across devices.","Buttons: Developed reusable and scalable button components with defined states (hover, active, disabled) and variants (primary, secondary, ghost). Ensured usability through intuitive interactions and visual cues.","Input Fields (Forms): Designed and standardized accessible input components—text fields, dropdowns, toggles, and checkboxes—with clear validation messaging and interaction patterns to reduce user friction.","Cards: Created versatile card templates adaptable to various use cases—content previews, user profiles, and product displays—with attention to layout, spacing, and responsive behavior.","Modals: Contributed to modal component patterns that supported important flows without disrupting user context. Focused on clarity, accessibility, and consistent entry/exit animations.","Navigation: Helped establish both primary and secondary navigation systems with clear hierarchy, visual consistency, and responsive behavior to support smooth user journeys.","Icons: Participated in curating and maintaining a unified icon library aligned with brand tone. Focused on legibility and consistent sizing across different UI scales and devices.","Alerts & Notifications: Built alert components reflecting different severity levels (info, success, warning, error), with distinct icons, colors, and messaging for effective user feedback and issue resolution.","Grid System & Layouts: Contributed to a flexible grid system that supported responsive layouts. Focused on spacing, alignment, and layout consistency across breakpoints and content types.","Layout Templates: Designed modular layout templates for key pages like dashboards, detail views, and onboarding. Enabled rapid prototyping and development while maintaining brand cohesion.","Data Tables: Developed accessible and functional data tables with sorting, filtering, and pagination capabilities. Prioritized clarity, alignment, and adaptability for complex data presentations."],"category":"DesignSystem","fileStructure":"''"}},"__N_SSG":true}