{"pageProps":{"project":{"slug":"Secure_meter","project_name":"Secure meter Design system","role":"Senior UX design engineer","teamSize":15,"projectType":"In-house","contribution":"Reduced user error by 20% | Increased developer engagement by 30%  | Delivered projects within budget and on schedule","detail":"Secure meter Design System led UX for critical security metering, prioritizing user needs throughout the lifecycle. This delivered innovative, user-friendly solutions, significantly improving customer satisfaction and operational efficiency by making complex features accessible.","photo":["/project/DesignSytem/Sec-1.png","/project/DesignSytem/Sec-2.png","/project/DesignSytem/Sec-3.png","/project/DesignSytem/Sec-4.png","/project/DesignSytem/Sec-5.png","/project/DesignSytem/Sec-6.png","/project/DesignSytem/Sec-7.png","/project/DesignSytem/Sec-8.png","/project/DesignSytem/Sec-9.png"],"year":"2022-2023","Learning":"Teamwork, Design, Team Lead, work Performance, Task Management","technology":["UX tools ","Interview ","Survey ","Adobe XD","Mero","Power Point","Excel","Agile"],"steps":["Color Palette: Developed a cohesive and accessible color system, including primary, secondary, accent, and semantic colors (success, error, warning). Ensured WCAG AA contrast ratios for readability across all UI elements, enhancing user experience and inclusivity..","Typography: Established a clear typographic hierarchy using a versatile font pairing. Defined consistent heading styles, body text, and caption treatments, improving content legibility and visual appeal across different screen sizes and contexts.","Buttons: Designed a scalable button system with clear states (default, hover, active, disabled) and variations (primary, secondary, tertiary). Focused on visual affordance and intuitive interaction, leading to improved user engagement and task completion.","Input Fields (Forms): Created a consistent and accessible form element library, including text inputs, dropdowns, checkboxes, and radio buttons. Implemented clear labeling, validation feedback, and error handling, resulting in reduced user input errors and improved form usability.","Cards: Developed flexible card components for displaying various content types, such as articles, products, and user profiles. Focused on clear information hierarchy and responsive layouts, enhancing content organization and scannability across devices.","Modals: Designed clear and concise modal patterns for displaying critical information and actions without disrupting the main user flow. Ensured proper focus management and accessibility, leading to improved user understanding and reduced errors during critical tasks.","Navigation: Established intuitive global and local navigation patterns, ensuring seamless user flow and information architecture. Focused on clear labeling, visual hierarchy, and responsive behavior, resulting in improved site navigation and user orientation.","Icons: Curated and designed a consistent icon library aligned with the brand language. Ensured clarity and scalability across different sizes and contexts, enhancing visual communication and user understanding of interface elements.","Alerts & Notifications: Designed clear and informative alert and notification components for providing feedback to users. Implemented different severity levels (success, error, warning, info) with distinct visual cues, improving user awareness and error recovery.","Grid System & Layouts: Implemented a flexible and responsive grid system, enabling consistent and adaptable layouts across various screen sizes. Ensured proper spacing and alignment, contributing to a visually harmonious and user-friendly experience.","Layout Templates: Developed a library of responsive layout templates for common page structures (e.g., landing page, article, product listing). Ensured consistency and efficiency in page creation, allowing for rapid prototyping and development across different content types and screen sizes.","Data Tables: Designed clear and functional data table components for presenting structured information effectively. Focused on readability, sortability, and filtering capabilities, improving data comprehension and user interaction with complex datasets."],"category":"DesignSystem","fileStructure":"''"}},"__N_SSG":true}